adamkondraciuk/nrfx/mdk/iar_startup_nrf7120_flpr.s
        PUBWEAK  PWM20_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
PWM20_IRQHandler
        j .

        PUBWEAK  PWM21_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
PWM21_IRQHandler
        j .

        PUBWEAK  PWM22_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
PWM22_IRQHandler
        j .

        PUBWEAK  SAADC_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SAADC_IRQHandler
        j .

        PUBWEAK  NFCT_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
NFCT_IRQHandler
        j .

        PUBWEAK  TEMP_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
TEMP_IRQHandler
        j .

        PUBWEAK  GPIOTE20_0_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
GPIOTE20_0_IRQHandler
        j .

        PUBWEAK  GPIOTE20_1_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
GPIOTE20_1_IRQHandler
        j .

        PUBWEAK  QDEC20_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
QDEC20_IRQHandler
        j .

        PUBWEAK  QDEC21_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
QDEC21_IRQHandler
        j .

        PUBWEAK  GRTC_0_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
GRTC_0_IRQHandler
        j .

        PUBWEAK  GRTC_1_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
GRTC_1_IRQHandler
        j .

        PUBWEAK  GRTC_2_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
GRTC_2_IRQHandler
        j .

        PUBWEAK  GRTC_3_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
GRTC_3_IRQHandler
        j .

        PUBWEAK  GRTC_4_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
GRTC_4_IRQHandler
        j .

        PUBWEAK  GRTC_5_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
GRTC_5_IRQHandler
        j .

        PUBWEAK  TDM_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
TDM_IRQHandler
        j .

        PUBWEAK  AUXPLL_AUXPM_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
AUXPLL_AUXPM_IRQHandler
        j .

        PUBWEAK  SERIAL23_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SERIAL23_IRQHandler
        j .

        PUBWEAK  SERIAL24_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SERIAL24_IRQHandler
        j .

        PUBWEAK  TAMPC_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
TAMPC_IRQHandler
        j .

        PUBWEAK  SPU30_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SPU30_IRQHandler
        j .

        PUBWEAK  SERIAL30_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SERIAL30_IRQHandler
        j .

        PUBWEAK  COMP_LPCOMP_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
COMP_LPCOMP_IRQHandler
        j .

        PUBWEAK  WDT30_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
WDT30_IRQHandler
        j .

        PUBWEAK  WDT31_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
WDT31_IRQHandler
        j .

        PUBWEAK  GPIOTE30_0_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
GPIOTE30_0_IRQHandler
        j .

        PUBWEAK  GPIOTE30_1_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
GPIOTE30_1_IRQHandler
        j .

        PUBWEAK  CLOCK_POWER_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
CLOCK_POWER_IRQHandler
        j .

        PUBWEAK  USBREG_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
USBREG_IRQHandler
        j .

        PUBWEAK  LFXO_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
LFXO_IRQHandler
        j .

        PUBWEAK  LFRC_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
LFRC_IRQHandler
        j .

        PUBWEAK  HFXO64M_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
HFXO64M_IRQHandler
        j .

        PUBWEAK  VREGMRAM_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VREGMRAM_IRQHandler
        j .

        PUBWEAK  VREGAO1V8_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VREGAO1V8_IRQHandler
        j .

        PUBWEAK  VREGAO0V8B_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VREGAO0V8B_IRQHandler
        j .

        PUBWEAK  VREGAO0V8A_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VREGAO0V8A_IRQHandler
        j .

        END


